# Importing the packages.

In [ ]:
import pandas as pd
import numpy as np
from datetime import datetime
import calendar

In [2]:
data= pd.read_csv('child_data.csv')
print('The Shape of the data is :',data.shape)
data.head(2)

The Shape of the data is : (39, 7)

,Unnamed: 0,name,Birth Month,Birth Year,Day,Height,Remarks
0,1,David,5,88,1st Monday,2'0'',Boy with Left biggerfoot and Right dominant hand
1,2,Lars,10,87,3rd Tuesday,2'1'',Boy with Left biggerfoot and Left dominant hand

### Slicing the unnecessary column.

In [3]:
data=data.iloc[:,1:]
data.head(2)

,name,Birth Month,Birth Year,Day,Height,Remarks
0,David,5,88,1st Monday,2'0'',Boy with Left biggerfoot and Right dominant hand
1,Lars,10,87,3rd Tuesday,2'1'',Boy with Left biggerfoot and Left dominant hand

## Inspecting the DataFrame.

In [166]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 39 entries, 0 to 38
Data columns (total 6 columns):
name           39 non-null object
Birth Month    39 non-null int64
Birth Year     39 non-null int64
Day            39 non-null object
Height         39 non-null object
Remarks        39 non-null object
dtypes: int64(2), object(4)
memory usage: 2.0+ KB

In [167]:
data.isnull().sum()

name           0
Birth Month    0
Birth Year     0
Day            0
Height         0
Remarks        0
dtype: int64

# Cleaning the Data to the given format

## Name | Date of Birth | Height(in cm) | Bigger Foot(L/R) | Dominant Hand(L/R)

## Height

In [157]:
y = data.iloc[:,4]
punctuations = '''!()-[]{};:'"\,<>./?@#$%^&*_~'''
no_punct = ""
for char in y:
   if char not in punctuations:
    no_punct = no_punct + char

# display the unpunctuated string
# print(no_punct)

l = []
for letter in no_punct:
    try:
        l.append(float(letter))
    except:
        continue


feet=[]
inches=[]
count=0
for count,i in enumerate(l):
    if count%2==0:
        feet.append(i)
    if count%2==1:
        inches.append(i)
    count=count+1

height=[]
for i in range(0,39):
    height.append(feet[i]*30.48+inches[i]*2.54)

In [158]:
height[0:10]

[60.96, 63.5, 60.96, 63.5, 63.5, 63.5, 66.04, 33.02, 33.02, 33.02]

## Gender

In [57]:
a=data.Remarks
gender=a.str.split('\s+').str[0]

In [58]:
gender[0:5]

0    Boy
1    Boy
2    Boy
3    Boy
4    Boy
Name: Remarks, dtype: object

## Dominant hand and bigger foot

In [159]:
bigger_foot=a.str.split('\s+').str[2]
dominant_hand=a.str.split('\s+').str[5]

## Birthdate Calculation

In [63]:
data.head(3)

,name,Birth Month,Birth Year,Day,Height,Remarks
0,David,5,88,1st Monday,2'0'',Boy with Left biggerfoot and Right dominant hand
1,Lars,10,87,3rd Tuesday,2'1'',Boy with Left biggerfoot and Left dominant hand
2,Zach,12,87,2nd Saturday,2'0'',Boy with Right biggerfoot and Right dominant ...

In [64]:
data['Birth Year']=data['Birth Year'].replace(to_replace=88,value=1988)
data['Birth Year']=data['Birth Year'].replace(to_replace=87,value=1987)

data.head(3)

,name,Birth Month,Birth Year,Day,Height,Remarks
0,David,5,1988,1st Monday,2'0'',Boy with Left biggerfoot and Right dominant hand
1,Lars,10,1987,3rd Tuesday,2'1'',Boy with Left biggerfoot and Left dominant hand
2,Zach,12,1987,2nd Saturday,2'0'',Boy with Right biggerfoot and Right dominant ...

In [65]:
calendar.isleap(1988)

True

### Assuming the year of 1900s and 1988 is a leap year

In [66]:
x= data.iloc[0:,1:4]
x.head(2)

   Birth Month  Birth Year          Day
0            5        1988   1st Monday
1           10        1987  3rd Tuesday

In [123]:
def calculateDate(year,month,day):
    day_list = day.split()
    int_day = 0
    for ch in day_list[0]:
        int_day = int(ch)
        break
    week_day = []
    for days in calendar.day_name:
        week_day.append(days)
        
    day = week_day.index(day_list[1])
    
    week_list = []
    for week in calendar.monthcalendar(1988,5):
        if week[day] != 0:
            week_list.append(week[day])
    day_num= week_list[int_day-1]
    print(day_num)
    x = str(year)+'-'+str(month)+'-'+str(day_num)
    return datetime.strptime(x,'%Y-%m-%d')

In [168]:
calculateDate(1988,5,'1st Monday')

2

datetime.datetime(1988, 5, 2, 0, 0)

In [169]:
x.head(3)

   birth_month  birth_year     birth_day
0            5        1988    1st Monday
1           10        1987   3rd Tuesday
2           12        1987  2nd Saturday

In [170]:
b_day=[]
for i in x.itertuples():
    b_day.append(calculateDate(i[2],i[1],i[3]))

2
17
14
3
2
6
5
22
13
9
27
18
4
19
16
19
11
10
22
12
21
11
3
7
28
27
25
17
16
16
25
17
13
22
14
1
5
12
22

In [154]:
b_day[0:5]

[datetime.datetime(1988, 5, 2, 0, 0),
 datetime.datetime(1987, 10, 17, 0, 0),
 datetime.datetime(1987, 12, 14, 0, 0),
 datetime.datetime(1988, 1, 3, 0, 0),
 datetime.datetime(1988, 2, 2, 0, 0)]

## Creating the Cleaned DataFrame

In [161]:
new_data={'Name':data.name,'Date of Birth':b_day,'Height(in cm)':height,'Bigger Foot(L/R)':bigger_foot,
          'Dominant Hand(L/R)':dominant_hand}
new_data=pd.DataFrame(new_data)

### Comparision of Orginal Data and Cleaned Data

In [163]:
data.head(3) # This is original data

,name,Birth Month,Birth Year,Day,Height,Remarks
0,David,5,1988,1st Monday,2'0'',Boy with Left biggerfoot and Right dominant hand
1,Lars,10,1987,3rd Tuesday,2'1'',Boy with Left biggerfoot and Left dominant hand
2,Zach,12,1987,2nd Saturday,2'0'',Boy with Right biggerfoot and Right dominant ...

In [164]:
new_data.head(3) # Cleaned Data

    Name Date of Birth  Height(in cm) Bigger Foot(L/R) Dominant Hand(L/R)
0  David    1988-05-02          60.96             Left              Right
1   Lars    1987-10-17          63.50             Left               Left
2   Zach    1987-12-14          60.96            Right              Right

In [165]:
new_data.to_csv('cleaned_child_data.csv')